Repository: 84000/data-translation-memory
Catalog: toh216-v3.tmx
Source language: bo
Languages: en

source: གཉི་ག་མེད་པར་ཡང་མེད་དེ། དེ་ནའང་མེད། གཞན་ནའང་མེད་པ།
en: It is not there or elsewhere.

source: ནམ་མཁའ་དང་མཚུངས་པ།
en: It is like space.

source: མི་མཉམ་པ་དང་མཉམ་པ། མི་འདྲ་བ། རྣམ་པར་རིག་པར་མི་འགྱུར་བ་སྟེ།
en: It is unparalleled and unlike anything, and it cannot be cognized.

source: དེ་ལ་མཁས་པས་མངོན་པར་ཆགས་པར་མི་བྱའོ། །བདག་གིར་མི་བྱའོ།
en: Those who are learned will not become attached to it or take it into possession.

source: །རྟེན་པར་མི་བྱའོ། །གནས་པར་མི་བྱའོ།
en: They will not indulge in it or dwell on it.

source: །བདག་ཏུ་བསམ་པར་མི་བྱའོ། །བདག་གིར་བསམ་པར་མི་བྱའོ།
en: They will not conceive of it as the self, and they will not think of it as a possession.

source: །ཀྱེ་སྐྱེས་བུ་དག་ཆོས་ཐམས་ཅད་ནི་རང་བཞིན་གྱིས་ནུས་པ་མེད་པས་གཡོ་བ་མེད་པའོ།
en: Listen, sir! All phenomena are unmoving because they lack such ability by nature. Listen, sir!

source: །ཀྱེ་སྐྱེས་བུ་དག་ང་ནི་དེ་ལྟར་མོས་པ་ལ་ཀུན་ནས་ཉོན་མོངས་པའམ། རྣམ་པར་བྱང་བའམ། ངན་སོང་དུ་འགྲོ་བའམ། མཐོ་རིས་སུ་འགྲོ་བར་མི་སྨྲའོ།
en: With that understanding, I do not speak of affliction or purification or of going to the lower realms or the higher realms.

source: གང་སེམས་ཀྱི་ཆོས་ཉིད་དེ་ནི་ཀུན་ནས་ཉོན་མོངས་པར་མི་འགྱུར། རྣམ་པར་དག་པར་མི་འགྱུར།
en: The nature of the mind cannot become afflicted or purified.

source: གང་དུ་ཡང་འགྲོ་བར་མི་འགྱུར། འོང་བར་མི་འགྱུར། འདུག་པར་མི་འགྱུར་རོ།
en: It does not go, come, or remain anywhere.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་སྐྱེས་བུ་སྤྲུལ་པ་དེས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་ཆོས་ཀྱི་དབྱིངས་ཡོངས་སུ་དག་པ། ལས་མ་མཆིས་པ། རྣམ་པར་སྨིན་པ་མ་མཆིས་པ། མ་སྐྱེས་པ། མ་གྲུབ་པ། མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ངོ་མཚར་ཏོ།
en: Then, the emanated person said to the Blessed One, “Blessed One, it is amazing that the Thus-Gone One fully understands the realm of phenomena to be pure, without actions, without ripening, unborn, and uncreated.

source: །བཅོམ་ལྡན་འདས་བདག་རབ་ཏུ་འབྱུང་བར་འཚལ་ན། བདེ་བར་གཤེགས་པ་རབ་ཏུ་དབྱུང་བར་གསོལ།
en: Blessed One, if I request ordination, I pray that the Well-Gone One will grant it.”

source: དགེ་སློང་ཚུར་ཤོག །ཚངས་པར་སྤྱད་པ་སྤྱོད་ཅིག་ཅེས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་དེ་སྐད་གསུངས་པ་དང་།
en: The Blessed One said to him, “Monk, come here. Engage in pure conduct.”

source: དེའི་མོད་ལ་དེ་རབ་ཏུ་བྱུང་བར་སྣང་སྟེ།
en: He appeared as an ordained person as soon as the Blessed One had said this.

source: བཅོམ་ལྡན་འདས་བདག་གིས་མངོན་པར་བགྱི་བ་ཐོབ་ཀྱིས་མྱ་ངན་ལས་འདའ་བར་འཚལ་ལོ་ཞེས་དེ་སྐད་ཀྱང་སྨྲས་སོ། །དེ་ལྟ་སྟེ།
en: He then said, “Blessed One, now that I have achieved this state, I will pursue nirvāṇa.”

source: དགེ་སློང་དེ་སངས་རྒྱས་ཀྱི་མཐུས་སྟེང་གི་བར་སྣང་ལ་ཤིང་ཏ་ལ་གང་ཙམ་དུ་འཕགས་ནས། བདག་གི་མེའི་ཁམས་ཀྱིས་ལུས་བསྲེགས་པ་དང་།
en: Then, through the power of the Buddha, the monk rose into the sky to the height of a palm tree, and his fire element incinerated his body.

source: སྐྱེས་བུ་ཡང་དག་པ་དེས་ཆོས་བསྟན་པ་འདི་དག་ཐོས་སོ། །ཐོས་ནས་ཀྱང་འདི་སྙམ་དུ་གྱུར་ཏེ། སྐྱེས་བུ་དེས་ནི་ཕ་དང་མ་གཉི་གའི་སྲོག་བཅད་ཀྱང་དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ན་བདག་གིས་ནི་མ་འབའ་ཞིག་གི་སྲོག་བཅད་དུ་ཟད་པས་ཅིའི་ཕྱིར་བདག་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ་སྙམ་ནས།
en: The real person had heard this Dharma teaching, and so he thought, “If this person who had murdered both his parents could reach parinirvāṇa, then why couldn’t I, who have merely murdered my mother, reach parinirvāṇa?”

source: དེ་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱི་དྲུང་དུ་སོང་སྟེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: He then approached the Blessed One and bowed his head at the Blessed One’s feet.

source: །བཅོམ་ལྡན་འདས་བདག་གིས་ཀྱང་མའི་སྲོག་བཀུམ་མོ།
en: He said, “Blessed One, I have murdered my mother.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སྐྱེས་བུ་དེ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ་ལེགས་སོ་ལེགས་སོ།
en: The Blessed One expressed his approval, saying, “Excellent. Excellent.

source: །སྐྱེས་བུ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་མ་བསླུས་མོད་ཀྱི།
en: Sir, indeed you do not attempt to deceive the Thus-Gone One.

source: ཀྱེ་སྐྱེས་བུ་ཁྱོད་སེམས་གང་གིས་མའི་སྲོག་བཅད་པ་སེམས་ཀྱི་རྒྱུད་ལ་རྟོགས་ཤིག་ཅེས་རྒྱ་ཆེར་བཀའ་སྩལ་ཏེ།
en: Yet listen, sir! Please consider the mind with which you murdered your mother.”

source: ཞིབ་ཏུ་སྤྲུལ་པའི་སྐྱེས་བུ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་བྱའོ།
en: The man did this as carefully as the emanated person had done.

source: །དེ་ནས་དེའི་ཚེ་སྐྱེས་བུ་དེའི་བ་སྤུའི་ཁུང་བུ་ཐམས་ཅད་ནས་སེམས་ཅན་དམྱལ་བའི་མེ་བྱུང་བར་གྱུར་ཏེ།
en: At that moment, the fires of hell emerged from each of this person’s pores.

source: དེ་ཚིག་ཅིང་མགོན་མེད་པ་དང་།
en: He burned and was helpless.

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: He called out to the Blessed One, “Blessed One, I am burning!

source: །བཅོམ་ལྡན་འདས་བདག་ནི་ཚིག་པར་གྱུར་ན་བདེ་བར་གཤེགས་པ་མགོན་མཛད་དུ་གསོལ།
en: Well-Gone One, please protect me!

source: །བཅོམ་ལྡན་འདས་ལ་སྐྱབས་སུ་མཆིའོ།
en: I take refuge in the Blessed One.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཕྱག་གསེར་གྱི་ཁ་དོག་ལྟ་བུ་སྐྱེས་བུ་དེའི་སྤྱི་བོར་བཞག་གོ། །ཕྱག་བཞག་མ་ཐག་ཏུ་དེ་ནས་དེའི་ཚེ། སྐྱེས་བུ་དེའི་ཚོར་བ་དེ་ཐམས་ཅད་རྒྱུན་ཆད་པར་གྱུར་ཏོ།
en: The Blessed One then placed his right hand, which was the color of gold, on this person’s head, and all this person’s agonies immediately ceased.

source: །དེ་ལུས་བག་ཡངས་ཤིང་བདེ་བར་གྱུར་ནས་དེ་བཞིན་གཤེགས་པ་ལ་ཤིན་ཏུ་གུས་པར་གྱུར་ཏེ།
en: As his body became relaxed and blissful, he developed extraordinary respect for the Thus-Gone One.

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ནི་རབ་ཏུ་འབྱུང་བར་འཚལ་ན། བདེ་བར་གཤེགས་པས་རབ་ཏུ་འབྱུང་བར་གསོལ།
en: He said to the Blessed One, “Blessed One, if I request ordination, I pray that the Well-Gone One will grant it.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་དགེ་སློང་ཚུར་ཤོག །
en: The Blessed One said to him, “Monk, come here.

source: ཚངས་པར་སྤྱད་པ་སྤྱོད་ཅིག་ཅེས་དེ་སྐད་བཀའ་སྩལ་པ་དང་།
en: Engage in pure conduct.”

source: དེའི་ཚེ་དེ་ཉིད་དུ་དེ་མགོ་བྲེགས། ཆོས་གོས་སྦྱར་མ་བགོས།
en: Immediately his head was shaved, he was dressed in Dharma robes, and his facial hair was shaved.

source: སྐྲ་དང་ཁ་སྤུ་བྲེགས་ནས་ཞག་བདུན་ལོན་པ་ཙམ་དུ་གྱུར་ཏེ། དགེ་སློང་བསྙེན་པར་རྫོགས་ནས་ལོ་བརྒྱ་ལོན་པའི་སྤྱོད་ལམ་དུ་གནས་པར་གྱུར་ཏོ། །དེ་བཞིན་གཤེགས་པས་ཚུར་ཤོག་ཅེས་གསུངས་ནས།
en: His appearance was as though just seven days had passed, yet he had the comportment of a monk who had completed his full ordination one hundred years ago.

source: །མགོ་བྲེགས་ལུས་ནི་ཆོས་གོས་སྦྱར་མར་ལྡན། །དེ་མ་ཐག་ཏུ་དབང་པོ་རབ་ཞི་ཞིང་། །སངས་རྒྱས་དགོངས་པའི་ཆ་ལུགས་གནས་པར་གྱུར།
en: As soon as the Blessed One had invited him to approach and his head was shaved and he was clothed in Dharma robes, his faculties became placid, and he observed the appearance that the Buddha had intended.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་དེ་ལ་འཕགས་པའི་བདེན་པ་བཞི་དང་ལྡན་པའི་གཏམ་བཤད་པ་དང་།
en: Then the Blessed One taught him a teaching on the four truths of the noble ones.

source: དེས་དེ་ཐོས་ནས་ཆོས་ལ་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བའི་ཆོས་ཀྱི་མིག་རྣམ་པར་དག་པའི་སྟེང་དུ་ཡང་ལམ་བསྒོམས་ནས་དགྲ་བཅོམ་པར་གྱུར་ཏེ།
en: Hearing this, he attained the pure Dharma eye that is immaculate and stainless with regard to phenomena. He then cultivated the path on that basis and became a worthy one.

source: དེས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འཚལ་ལོ།
en: Then he said to the Blessed One, “Blessed One, I have pursued parinirvāṇa.

source: །བདེ་བར་གཤེགས་པ་བདག་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་དུས་དང་མན་ལ་བབ་བོ།
en: Well-Gone One, now the time and occasion for my parinirvāṇa has arrived.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་ཁྱོད་ད་དེའི་དུས་ལ་བབ་པར་ཤེས་པར་གྱིས་ཤིག །
en: The Blessed One responded, “Monk, you are correct in knowing that the time has come.”

source: དེས་དེའི་ཚེ་སྟེང་གི་བར་སྣང་ལ་ཤིང་ཏ་ལ་བདུན་ཙམ་ན་འདུག་སྟེ། བདག་གི་མེའི་ཁམས་ཀྱིས་ལུས་བསྲེགས་སོ།
en: The monk then rose into the sky to the height of seven palm trees, and his fire element incinerated his body, leaving no embers or ashes behind.

source: །བསྲེགས་པ་དེའི་ཚེ་སོལ་བ་དང་ཐལ་བ་ཡང་མེད་པར་གྱུར་ནས་ལྷ་བརྒྱ་སྟོང་དག་ཀྱང་དེ་ལ་ཕྱག་འཚལ་བར་གྱུར་ཏོ།
en: Hundreds of thousands of gods then prostrated to him.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་སྐྱེས་བུ་དེའི་གདུལ་བ་མཐོང་ནས་ངོ་མཚར་དུ་གྱུར་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །དེ་བཞིན་གཤེགས་པའི་ཆོས་འདུལ་བ་ནི་ལེགས་པར་གསུངས་པ་སྟེ།
en: Venerable Śāriputra was amazed when he saw how this monk had been trained, so he said to the Blessed One, “The Thus-Gone One’s Dharma-Vinaya is well spoken.

source: དེ་ལ་ནི་མཚམས་མ་མཆིས་པ་དང་ལྡན་པ་དག་ཀྱང་འདུལ་བར་འགྱུར་བ་བཅོམ་ལྡན་འདས་ངོ་མཚར་ཏོ།
en: Even those who have committed the acts that bring immediate results can be trained. Blessed One, it is amazing.

source: །བདེ་བར་གཤེགས་པ་ངོ་མཚར་ཏོ།
en: Well-Gone One, it is incredible.

source: །བཅོམ་ལྡན་འདས་སེམས་ཅན་རྣམས་ཀྱི་དབང་པོ་རྣམ་པ་སྣ་ཚོགས་འཚལ་བ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཞན་ཡང་དེ་འདྲ་བའི་གོ་ཆ་དག་བགོས་པ་མ་གཏོགས་པར་གཞན་སུའི་ཡུལ་ལགས།
en: Blessed One, besides the thus-gone, worthy, perfect Buddha, Mañjuśrī Kumārabhūta, and other bodhisattva great beings who don such armor, in whose domain does the knowledge of the various faculties of beings exist?

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ནི་ཡུལ་མ་ལགས་སོ།
en: It is not in the domain of the hearers and solitary buddhas.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་དེ་བཞིན་ནོ།
en: The Blessed One answered, “Śāriputra, thus it is.

source: །ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་ཏེ།
en: It is as you have said.

source: དེ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པ་ལ་གནས་པ་རྣམས་ཀྱི་ཡུལ་ཡིན་ཏེ།
en: It is the domain of the blessed buddhas and bodhisattva great beings who have gained acceptance.

source: ཤཱ་རིའི་བུ་གང་ཟག་གང་ཁྱོད་ཀྱིས་སེམས་ཅན་དམྱལ་བ་པར་ཤེས་ལ་དེ་དག་ལ་ངས་མྱ་ངན་ལས་འདའ་བའི་ཆོས་ཅན་དུ་མཐོང་བ་ཡང་ཡོད་དོ།
en: Śāriputra, beings you see as hell beings I see as possessing the quality of nirvāṇa.

source: །ཤཱ་རིའི་བུ་ཁྱོད་ཀྱིས་གང་ཟག་གང་སྦྱངས་པའི་ཡོན་ཏན་དང་། ཆོག་ཤེས་པ་དང་། ཚུལ་ཁྲིམས་དང་། ཐོས་པ་དང་། ཏིང་ངེ་འཛིན་ཙམ་དང་ལྡན་ཏེ།
en: Śāriputra, you only know beings who possess ascetic practices, contentment, discipline, hearing, and absorption as possessing the quality of nirvāṇa.

source: དེ་ལ་ཁྱོད་ཀྱིས་མྱ་ངན་ལས་འདའ་བའི་ཆོས་ཅན་དུ་ཤེས་མོད་ཀྱི། དེ་ལ་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་དམྱལ་བ་པར་གཟིགས་པ་ཡང་ཡོད་ཀྱིས།
en: However, the Thus-Gone One also sees them as hell beings.

source: ཤཱ་རིའི་བུ་ཁྱོད་ནི་སེམས་ཅན་གྱི་སྤྱོད་པ་ལ་བསམ་པ་དང་བྲལ་བར་གྱིས་ཤིག །
en: Therefore, Śāriputra, give up your concepts regarding the conduct of beings.

source: ཤཱ་རིའི་བུ་སེམས་ཅན་གྱི་སྤྱོད་པ་ནི་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར་རོ།
en: Śāriputra, the conduct of beings is inconceivable.

source: །ཤཱ་རིའི་བུ་གང་གིས་མ་བསད་ནས་ཆོས་བསྟན་པ་འདི་ལ་གནས་ཏེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་གྱུར་པའི་སྐྱེས་བུ་དེ་ཁྱོད་ཀྱིས་མཐོང་ངམ།
en: Śāriputra, did you see the person who had murdered his mother and then, by observing this Dharma teaching, reached parinirvāṇa?” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་གིས་མཐོང་ངོ་། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed One, I did see him.”

source: ཤཱ་རིའི་བུ་སྐྱེས་བུ་དེས་ནི་སངས་རྒྱས་ལྔ་བརྒྱ་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པར་གྱུར་ཅིང་། འདི་ལྟ་སྟེ། སེམས་རང་བཞིན་གྱིས་དང་བའི་ཆོས་བཤད་པ་འདི་ཡང་ཐོས་སོ།
en: The Blessed One continued, “Śāriputra, that person had developed roots of virtue with five hundred buddhas such that he was able to hear my teaching that the mind is naturally lucid.

source: །ཤཱ་རིའི་བུ་སྐྱེས་བུ་དེས་ཆོས་བསྟན་པ་འདི་ཐོས་ནས་ཆོས་ཐམས་ཅད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མཐོང་བའི་ཕྱིར་རྣམ་པར་གྲོལ་བར་གྱུར་ཏོ། །དེ་བས་ན་ཤཱ་རིའི་བུ་རྣམ་གྲངས་འདིས་ཀྱང་འདི་ལྟར་རིག་པར་བྱ་སྟེ། གང་སུ་ཡང་རུང་སྟེ།
en: Śāriputra, when that person heard this Dharma teaching, he was liberated because he saw all phenomena accurately.

source: ད་ལྟར་རམ། ང་མྱ་ངན་ལས་འདས་པ་ན་ཡང་ཟབ་མོ་ཆགས་པ་མེད་པ། འགྲོ་བ་མེད་པ་འདི་ལྟ་བུའི་ཆོས་བསྟན་པ་ཉན་ལ་ཐོས་ནས་ཀྱང་མོས་པར་བྱེད་ན་སེམས་ལ་ཀུན་ནས་ཉོན་མོངས་པའམ། སྡིག་པའི་གྲོགས་པོའི་དབང་གིས་མི་དགེ་བའི་འདུ་བྱེད་དག་མངོན་པར་བྱེད་ཀྱང་། མ་ལུས་པར་རྣམ་པར་གྲོལ་བར་མ་གྱུར་གྱི་བར་དུ་ཆོས་ལ་རྟོགས་པ་དེ་གཏོང་བར་མི་འགྱུར་རོ།
en: Therefore, Śāriputra, understand the following point from this teaching: anyone at all—whether at present or when I have entered nirvāṇa—who listens to a Dharma teaching such as this on nonattachment, profundity, and the absence of going and who trusts in it will not give up this understanding of the Dharma until they reach liberation without remainder, even if they have created nonvirtuous actions under the influence of mental afflictions or evil companions. “

source: །ཤཱ་རིའི་བུ་གང་དག་ཆོས་འདི་འདྲ་བ་ལ་མོས་པར་གྱུར་པ་དེ་དག་ནི་འགྲོ་བ་ངན་པར་འགྲོ་བར་ང་མི་སྨྲའོ།
en: Śāriputra, I do not declare that someone who trusts such a Dharma teaching will go to the lower realms.

source: །ཤཱ་རིའི་བུ་དེ་བས་ན་གང་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལས་ཆུང་ངུ་ན་རྩ་བ་བཞི་པའི་ཚིགས་སུ་བཅད་པ་གཅིག་གམ། ཚིག་གཅིག་ལེན་པ་དང་། གཞན་ལ་སྟོན་པའི་སེམས་ཅན་དེ་དག་ངེས་པར་ཐམས་ཅད་མཁྱེན་པར་འགྱུར་བར་བལྟ་ན། གང་དག་ཐོས་ནས་ཚུལ་བཞིན་དུ་བྱེད་པ་ལྟ་ཅི་སྨོས།
en: Therefore, Śāriputra, if someone who takes even a single four-line verse or even a single word of this Dharma teaching and teaches it to others, they will definitely become omniscient, so what need we say of those who hear it and practice it correctly?”

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། འོད་སྲུང་ཆེན་པོ་ལ་སོགས་པ་ཉན་ཐོས་དག་དང་། རྒྱལ་པོ་མ་སྐྱེས་དགྲ་དང་། གཞན་ཡང་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་དང་འགྲོགས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་།
en: Then Mañjuśrī Kumārabhūta came to the Blessed One accompanied by the bodhisattvas, the great hearers, such as Mahākāśyapa, King Ajātaśatru, and the rest of the great assembly of beings.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: They bowed their heads to the feet of the Blessed One and sat to one side.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས། རྒྱལ་པོ་མ་སྐྱེས་དགྲ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱི་འགྱོད་པ་དེ་བསལ་ཏམ། སྨྲས་པ།
en: Then venerable Śāriputra said to King Ajātaśatru, “Great King, has your remorse been eliminated?” “

source: བཙུན་པ་ཤཱ་རིའི་བུ་བསལ་ཏོ།
en: Venerable Śāriputra, it has.”

source: །ཤཱ་རིའི་བུས་སྨྲས་པ། ཇི་ལྟར་བསལ། སྨྲས་པ།
en: Śāriputra asked, “How has it been eliminated?” “

source: ཅི་ནས་ཀྱང་མི་ལེན་པ་དང་། མི་གཏོང་བ་དེ་ལྟར་བསལ་ཏོ།
en: It has been eliminated by not accepting or rejecting anything at all.

source: །ཅི་ནས་ཀྱང་སླན་ཆད་ཤིན་ཏུ་ཉོན་མོངས་པར་མི་འགྱུར་བ་དང་། ཅི་ནས་ཀྱང་ཐོབ་པ་ཡང་མེད། ཕྲོགས་པ་ཡང་མེད་པ་དེ་ལྟར་བསལ་ཏོ།
en: It has been eliminated by henceforth not becoming afflicted in any way, and by not gaining or losing anything at all.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then venerable Śāriputra said to the Blessed One, “Blessed One, how much of King Ajātaśatru’s former action remains?

source: །བཅོམ་ལྡན་འདས་རྒྱལ་པོ་མ་སྐྱེས་དགྲའི་ལས་ཀྱི་ལྷག་མ་ཅི་ཙམ་ཞིག་ནི་ལུས་ཅི་ཙམ་ཞིག་ནི་ལྷག་མ་མ་ལུས་པར་བྱང་ཞིང་སླན་ཅད་མི་སྐྱེ་བའི་ཆོས་ཅན་དུ་གྱུར།
en: How much has been purified without remainder such that it will not arise again later?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་རྒྱལ་པོ་མ་སྐྱེས་དགྲའི་ལས་ཀྱི་ལྷག་མ་ཡུངས་ཀར་གྱི་འབྲུམ་བུ་ཙམ་ནི་ལུས་སོ།
en: The Blessed One responded, “Śāriputra, only about as much as a mustard seed of King Ajātaśatru’s former action remains.

source: །རི་རབ་རིའི་རྒྱལ་པོ་ཙམ་ནི་ཆོས་ཟབ་མོ་འདི་བསྟན་པ་ཁོང་དུ་ཆུད་པས་ལྷག་མ་མ་ལུས་པར་བྱང་སྟེ། ཕྱིན་ཅད་མི་སྐྱེ་བའི་ཆོས་ཅན་དུ་གྱུར་ཏོ།
en: By understanding this profound Dharma teaching, an amount the size of Mount Meru has been purified without remainder, such that it will not arise again.” “

source: །གསོལ་པ། ཅི་བཅོམ་ལྡན་འདས་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་སེམས་ཅན་དམྱལ་བར་མཆིའམ།
en: Blessed One, will King Ajātaśatru go to hell?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ལྷའི་བུ་རིན་པོ་ཆེའི་ཁང་པ་བརྩེག་མ་ན་འདུག་པ་ལས་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷའི་གནས་ནས་འཛམ་བུའི་གླིང་དུ་འབབ་ཅིང་།
en: The Blessed One answered, “Śāriputra, to draw an analogy, a god living in a jeweled mansion might fall from the Heaven of the Thirty-Three down to Jambudvīpa.

source: འཛམ་བུའི་གླིང་དུ་བབས་ནས་སླར་ཡང་སུམ་ཅུ་རྩ་གསུམ་གྱི་གནས་སུ་འཛེག་པ་དེ་བཞིན་དུ་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་ཡང་སོ་སོའི་སེམས་ཅན་དམྱལ་བ་མེ་ཏོག་པུན་ད་རཱི་ཀ་ཞེས་བྱ་བར་བབས་ནས་དེ་བཞིན་དུ་འཛེགས་ཏེ།
en: Having reached Jambudvīpa, the god might then ascend back up to the Heaven of the Thirty-Three. Similarly, King Ajātaśatru will fall to the particular hell realm called White Lotus before ascending again.

source: དེ་ལུས་ལ་སྡུག་བསྔལ་བའི་ཚོར་བ་རེག་པར་ཡང་མི་འགྱུར་རོ།
en: His body will not incur any painful experiences.”

source: །ཤཱ་རིའི་བུས་གསོལ་པ། བཅོམ་ལྡན་འདས་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་ནི་དབང་པོ་རྣོ་སྟེ།
en: Śāriputra said, “Blessed One, King Ajātaśatru has sharp faculties.

source: དེས་ལས་ཀྱི་སྒྲིབ་པ་མྱོང་བར་འགྱུར་བ་འདི་ཙམ་ཞིག་ཏུ་བགྱིས་པ་ངོ་མཚར་ཏོ།
en: It is amazing that he could experience karmic obscurations in this manner.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་འདིས་སངས་རྒྱས་བྱེ་བ་ཕྲག་བདུན་ཅུ་རྩ་གཉིས་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་དེ།
en: The Blessed One continued, “Śāriputra, King Ajātaśatru has developed roots of virtue with seven hundred twenty million buddhas.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་ལ་འདིས་བསྙེན་བཀུར་ཀྱང་བྱས་པར་གྱུར་ཏོ།
en: He served those perfect buddhas.

source: །དེ་དག་ལས་ཆོས་ཀྱང་ཐོས་པར་གྱུར་ཏོ།
en: He heard Dharma from them.

source: །དགེ་བའི་རྩ་བ་དེ་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་བསྔོས་པར་གྱུར་ཏོ།
en: He dedicated those roots of virtue to unsurpassed and perfect awakening.

source: །ཤཱ་རིའི་བུ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་འདི་མཐོང་ངམ། གསོལ་པ། མཐོང་ངོ་།
en: Śāriputra, do you see Mañjuśrī Kumārabhūta?”

source: ཤཱ་རིའི་བུ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་འདིས་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་འདི་བསྐལ་པ་དྲི་མ་མེད་པ་ཞེས་བྱ་བ་ན། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཕྱག་བཟངས་ཞེས་བྱ་བའི་གསུང་རབ་ལས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དུ་བཅུག་གོ།
en: The Blessed One continued, “Śāriputra, in the eon called Immaculate, during the lifetime of the blessed thus-gone one called Excellent Hand, Mañjuśrī Kumārabhūta inspired King Ajātaśatru to develop the mind directed toward unsurpassed and perfect awakening.

source: །ཡང་ཤཱ་རིའི་བུ་བསྐལ་པ་དྲི་མ་མེད་པ་ལ་སངས་རྒྱས་བྱེ་བ་ཕྲག་གསུམ་བྱུང་སྟེ།
en: Śāriputra, during that eon called Immaculate, thirty million buddhas appeared.

source: དེ་ཐམས་ཅད་ཀྱང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དང་། ཚེ་རིང་བར་གསོལ་བར་གྱུར་ཏོ།
en: Mañjuśrī Kumārabhūta requested each of them to live for a long time as they turned the wheel of Dharma.

source: །ཤཱ་རིའི་བུ་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་འདི་ནི་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་མ་གཏོགས་པར་སངས་རྒྱས་སྟོང་གིས་ཀྱང་ཆོས་བཤད་དེ། འགྱོད་པ་དེ་བསལ་བར་བྱ་བའི་གནས་དང་གོ་སྐབས་མེད་དོ།
en: Śāriputra, with the exception of Mañjuśrī Kumārabhūta, one thousand buddhas taught King Ajātaśatru the Dharma without finding the opportunity or occasion to eliminate his remorse.

source: འདི་ཉིད་ཀྱིས་གདུལ་བ་ཡིན་ཏེ།
en: It was Mañjuśrī Kumārabhūta himself who had guided him.

source: ཕྱི་ཕྱིར་ཞིང་འདིས་ཆོས་ཟབ་མོ་བསྟན་པ་འདི་ཉིད་ལས་ཐོས་པར་གྱུར་ཏོ།
en: Again and again he had taught him the profound Dharma. It was from him that he became learned. “

source: །དེ་བས་ན་ཤཱ་རིའི་བུ་རྣམ་གྲངས་དེས་ཀྱང་འདི་ལྟར་རིག་པར་བྱ་སྟེ། གང་དང་གང་དག་བྱང་ཆུབ་སེམས་དཔའ་གང་དང་གང་ལས་འདུལ་བར་འགྱུར་བ་དེ་དང་དེ་ཉིད་ཀྱི་ཆོས་བསྟན་པ་ཤེས་པར་འགྱུར་རོ།
en: Therefore, Śāriputra, you should understand the following point from this teaching: Whenever a bodhisattva guides someone, that person will understand their precise Dharma teaching.

source: །ཤཱ་རིའི་བུ་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་འདི་ཡང་སོ་སོའི་སེམས་ཅན་དམྱལ་བ་མེ་ཏོག་པུན་ད་རཱི་ཀ་ལྟར་གས་པ་དེ་ནས་བྱུང་ནས་རྨ་མེད་ཅིང་མ་རྨས་པར་སྟེང་གི་ཕྱོགས་ཀྱི་ཆ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་བཞི་སྟོང་བཞི་བརྒྱ་འདས་པ་ན། དེ་འཇིག་རྟེན་གྱི་ཁམས་བརྒྱན་པ་ཞེས་བྱ་བ་དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་ཕུང་པོ་ཞེས་བྱ་བ་བཞུགས་ཤིང་འཚོ་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྐྱེ་བར་འགྱུར་རོ།
en: Śāriputra, when King Ajātaśatru emerges from the hell called Cracked Open Like a White Lotus, he will be uninjured and unscathed. He will then proceed upward from this buddha realm past four thousand four hundred other buddha realms and take birth in the buddha realm where the thus-gone, worthy, perfect Buddha Pile of Jewels lives, thrives, is well, and teaches the Dharma.

source: །དེ་དེར་སྐྱེས་མ་ཐག་ཏུ་སླར་ཡང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ཡང་མཐོང་བར་འགྱུར་རོ།
en: As soon as he is born there, he will again behold Mañjuśrī Kumārabhūta.

source: །ཆོས་ཟབ་མོ་བསྟན་པ་འདི་ཡང་ཐོས་པར་འགྱུར་རོ། །ཐོས་ནས་ཀྱང་དེ་ཉིད་དུ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་འགྱུར་རོ།
en: He will also hear this profound Dharma teaching again, whereupon he will gain the acceptance that phenomena are nonarising. “

source: །གང་གི་ཚེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་དེའི་ཚེ་ཡང་སླར་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་མཐོང་བར་འགྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མི་གཡོ་བ་ཞེས་བྱ་བར་འགྱུར་རོ།
en: When the bodhisattva great being Maitreya fully awakens to buddhahood, King Ajātaśatru will again behold Mañjuśrī Kumārabhūta, and he will be known as the bodhisattva great being Unwavering.

source: །དེ་ན་ཡང་བྱམས་པ་དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་སེམས་དཔའ་མི་གཡོ་བ་ལ་སོགས་པ་ལ་སྔོན་བྱུང་བ་དང་ལྡན་པའི་ཆོས་ཀྱི་གཏམ་བརྗོད་པར་འགྱུར་ཏེ།
en: At that time, the thus-gone Maitreya will deliver before to the bodhisattva Unwavering and others a Dharma lesson containing the tale of what occurred.

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡང་མ་ལྷག་མ་བྲི་བར་བརྗོད་པར་འགྱུར་རོ།
en: He will give this Dharma teaching without anything being added or left out.

source: །ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མི་གཡོ་བ་འདི་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པའི་གསུང་རབ་ལ་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་ཞེས་བྱ་བར་གྱུར་ཏེ།
en: He will declare that the bodhisattva great being Unwavering was King Ajātaśatru during the lifetime of the blessed, thus-gone Śākyamuni and that he murdered his own father.

source: དེས་ཕའི་སྲོག་བཅད་ནས་དེས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལས་ཐོས་ཏེ་འཐུན་པའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ།
en: He will then hear this Dharma teaching from Mañjuśrī Kumārabhūta and gain the acceptance of phenomena that accords with reality.

source: །དེའི་ལས་ཀྱི་སྒྲིབ་པ་ཡང་མ་ལུས་པར་བྱང་བར་གྱུར་ཏོ་ཞེས་དེ་སྐད་ཀྱང་བརྗོད་པར་འགྱུར་རོ།
en: It will also be declared that his karmic obscurations have been purified without remainder. “

source: །ཤཱ་རིའི་བུ་དེ་ལྟ་སྟེ། བྱམས་པ་དེ་བཞིན་གཤེགས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མི་གཡོ་བ་ལ་སོགས་པ་ལ་ཅི་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་བརྒྱད་སྟོང་གིས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྟོན་པར་འགྱུར་རོ།
en: Śāriputra, the thus-gone Maitreya will give this Dharma teaching so that eight thousand bodhisattvas, including the bodhisattva great being Unwavering, will gain acceptance that phenomena are nonarising.

source: །དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཉི་ཁྲི་ཉིས་སྟོང་གི་ལས་ཀྱི་སྒྲིབ་པ་བསྐལ་པ་གྲངས་མེད་པ་ནས་བསགས་པ་ཡང་རབ་ཏུ་ཞི་བར་འགྱུར་རོ།
en: The karmic obscurations of twenty-two thousand bodhisattvas gathered throughout countless eons will be pacified.

source: །རྒྱལ་པོ་མ་སྐྱེས་དགྲ་འདི་དེ་ཕན་ཅད་བསྐལ་པ་གྲངས་མེད་པ་ཕྲག་བརྒྱད་བརྒྱའི་བར་དུ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་སྦྱོང་བར་བྱེད་ཅིང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་དོ།
en: Henceforth, over a period of eight hundred countless eons, King Ajātaśatru will mature beings, purify buddha realms, and engage in bodhisattva conduct. “

source: །ཤཱ་རིའི་བུ་སེམས་ཅན་གང་དག་དེས་ཉན་ཐོས་ཀྱི་ཐེག་པས་སམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པས་སམ། ཐེག་པ་ཆེན་པོས་ཡོངས་སུ་སྨིན་པར་བྱས་པར་འགྱུར་བའི་སེམས་ཅན་དེ་དག་ནི་ལས་ཀྱི་སྒྲིབ་པའམ། ཉོན་མོངས་པའི་སྒྲིབ་པ་མེད་པར་འགྱུར་ཏེ།
en: Śāriputra, he will eliminate the karmic obscurations and the afflictive obscurations of beings, maturing them through the Hearer Vehicle, the Solitary Buddha Vehicle, or the Great Vehicle.

source: དེ་དག་ཐམས་ཅད་དབང་པོ་རྣོ་བར་འགྱུར།
en: All of them will gain sharp faculties.

source: འགྱོད་པ་དང་ཐེ་ཙོམ་མེད་པར་འགྱུར་རོ།
en: They will eliminate remorse and doubt. “
